load C5-piano.mat;
% r1_1=[8,1,3,5,6,8,1,1,10,6,8,10,12,13,1,1];
% r1_2=[6,8,6,5,3,5,6,5,3,1,0,1,3,5,1,3,100,100];
% r1=[r1_1,r1_2];%数值音符
% r2_1=[1,1/2,1/2,1/2,1/2,1,1,1,1,1/2,1/2,1/2,1/2,1,1,1];
% r2_2=[1,1/2,1/2,1/2,1/2,1,1/2,1/2,1/2,1/2,1,1/2,1/2,1/2,1/2,1,1,1];
% r2=[r2_1,r2_2];%节奏
% time_r2=max(size(r2));

l1_1=[-7,100,-9,-7,100,100,-6,100,100,-7,100,100];
l1_2=[-9,100,100,-11,100,100,-4,-7,-11,-4,-4,-6,-7,-9];
l1=[l1_1,l1_2];
l2=0.5*[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1/2,1/2,1/2,1/2];
time_l2=max(size(l2));

t=1;
%-------------------播放---------------------
while(time_r2>=t)
%     my_sound(r1(t),data,fs);
%     pause(r2(t));
    my_sound(l1(t),data,fs);
    pause(l2(t));
    t=t+1;
end

%音符播放函数:
function my_sound(original_note,data,fs)
badu=floor(original_note/12);%数值音符除以12得所在八度
note=mod(original_note,12);%数值音符对12取余得实际所在八度具体第几个音符
fs_c=fs*2^(note/12)*2^(badu-1);%八度减1整体降一个八度
if(original_note~=100)
    sound(data(1:35000,:),fs_c);
end
end